{
  "base": {
    "name": "Neill Holloman",
    "title": "Retail & Customer Service Professional",
    "address": "Honolulu, HI 96817",
    "email": "neill@holloman.life",
    "photo": "profileImage.jpg",
    "summary": "Dependable and detail-oriented professional with over 15 years of experience in retail, grocery, and logistics. Known for building team morale, maintaining operational accuracy, and creating efficient, safe work environments. Experienced in leading by example, mentoring new associates, and supporting management through process improvement and workflow coordination. Passionate about growing into a retail supervisory role where consistent service, organization, and accountability drive team success.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/neill-holloman-70a5b030/",
      "github": "https://github.com/AhonuiHawaii",
      "portfolio": "https://github.com/AhonuiHawaii"
    }
  },
  "resumes": {
    "customerService": {
      "experience": [
        {
          "company": "Amazon",
          "role": "Delivery Station Associate",
          "startDate": "2024-08-01",
          "endDate": null,
          "location": "Honolulu, HI",
          "summary": "Drive accuracy, safety, and workflow efficiency in a high-volume logistics setting. Recognized for proactive safety leadership and continuous process improvements that reduce delays and support smooth package flow. Known for reliability, attention to detail, and commitment to maintaining compliance with safety and environmental standards.",
          "responsibilities": [
            "Operate Logistiqs Conveyor systems including Induct, Unload, Pusher, Diverter, Straightener, and Stow stations to sustain smooth package flow.",
            "Restructured the Hazmat cage by grouping materials such as Corrosive, Flammable, Environmental Hazard, Food-Grade Waste, and E-Waste for safer handling and quicker access.",
            "Researched EPA classifications to support accurate identification and disposal of hazardous materials.",
            "Trained an associate in Hazmat handling and documentation procedures to maintain compliance and consistency.",
            "Served on the Associate Safety Committee for six months, assisting with safety walks and hazard reduction initiatives.",
            "Performed detailed reviews of problem packages, ensuring proper processing and compliance with delivery timelines.",
            "Submitted over 150 safety and process improvement reports through digital reporting platforms."
          ]
        },
        {
          "company": "Advantage Solutions",
          "role": "Sales Advisor",
          "startDate": "2024-04-01",
          "endDate": "2024-08-01",
          "location": "Honolulu, HI",
          "summary": "Engaged customers through clear, friendly demonstrations that consistently achieved sales goals. Combined strong communication and product knowledge to create positive experiences while maintaining compliance with company and health standards.",
          "responsibilities": [
            "Delivered live product demonstrations that regularly achieved daily and weekly sales goals.",
            "Built rapport with customers through active listening and clear explanation of product benefits.",
            "Adapted to multiple product categories while maintaining brand consistency and presentation quality.",
            "Ensured demonstration areas met company, health, and sanitation standards."
          ]
        },
        {
          "company": "TJ Maxx & HomeGoods",
          "role": "Backroom Associate",
          "startDate": "2024-04-01",
          "endDate": "2024-08-01",
          "location": "Honolulu, HI",
          "summary": "Supported retail operations by organizing freight, tagging merchandise, and maintaining a safe, efficient backroom. Contributed to faster product turnaround and stronger inventory accuracy through teamwork and dependable performance.",
          "responsibilities": [
            "Unloaded incoming freight and organized merchandise for efficient processing.",
            "Applied security tags to high-value products to reduce shrink and maintain store security.",
            "Prepared carts and racks to support floor replenishment and product rotation.",
            "Maintained backroom organization and ensured compliance with safety procedures."
          ]
        },
        {
          "company": "Food Pantry, Ltd.",
          "role": "Scan Coordinator",
          "startDate": "2022-10-01",
          "endDate": "2023-09-01",
          "location": "Honolulu, HI",
          "summary": "Ensured store-wide pricing accuracy through detailed audits and collaboration with corporate teams. Identified and resolved scanning issues, implemented markdowns, and supported smooth daily operations through reliable data management.",
          "responsibilities": [
            "Audited 1,000–2,000 pricing scans monthly to maintain compliance and accuracy.",
            "Worked with corporate IT teams to troubleshoot ESL (Electronic Shelf Label) malfunctions.",
            "Managed grocery orders during leadership absences to maintain stock levels.",
            "Implemented pricing updates and markdowns to optimize sales and reduce waste.",
            "Corrected scan errors and labeling discrepancies to ensure operational consistency."
          ]
        },
        {
          "company": "Lowe’s Home Improvement",
          "role": "Cashier",
          "startDate": "2022-01-01",
          "endDate": "2022-09-01",
          "location": "Honolulu, HI",
          "summary": "Delivered fast, accurate service while building trust with customers. Ranked among top performers in customer satisfaction for the Pacific Region and consistently exceeded sales goals through clear communication and professionalism.",
          "responsibilities": [
            "Ranked #2 in the Pacific Region for customer satisfaction scores.",
            "Consistently promoted and activated store credit programs to meet sales targets.",
            "Handled returns, exchanges, and payments with accuracy and professionalism.",
            "Supported smooth traffic flow at registers by maintaining organized work areas."
          ]
        },
        {
          "company": "Starbucks",
          "role": "Barista",
          "startDate": "2021-12-01",
          "endDate": "2022-07-01",
          "location": "Honolulu, HI",
          "summary": "Prepared beverages accurately and efficiently while providing welcoming, attentive service. Maintained composure and teamwork during peak hours and ensured cleanliness and consistency across all shifts.",
          "responsibilities": [
            "Prepared espresso and blended beverages according to company standards.",
            "Handled cash transactions and POS operations with accuracy and speed.",
            "Collaborated with teammates during peak hours to maintain workflow.",
            "Monitored inventory and maintained a clean workstation throughout each shift."
          ]
        },
        {
          "company": "Y. Hata & Co., Ltd. (ChefZone)",
          "role": "Night Stock Clerk",
          "startDate": "2021-05-01",
          "endDate": "2021-08-01",
          "location": "Honolulu, HI",
          "summary": "Handled overnight receiving and restocking operations with precision and focus on safety. Maintained stock accuracy, cleanliness, and organization while operating warehouse equipment and supporting team efficiency.",
          "responsibilities": [
            "Received and organized shipments accurately, verifying quantities and condition.",
            "Operated electric pallet jacks and reach forklifts to transport goods safely.",
            "Rotated inventory, maintained shelf cleanliness, and ensured proper labeling.",
            "Assisted customers and ChefZone members with product locations and inquiries.",
            "Followed HAACP and GMP guidelines for safe food handling and storage."
          ]
        },
        {
          "company": "Longs Drugs",
          "role": "Customer Service Associate",
          "startDate": "2021-03-01",
          "endDate": "2021-05-01",
          "location": "Honolulu, HI",
          "summary": "Provided friendly, dependable service while processing transactions and assisting customers with store navigation. Maintained accuracy in sales and product placement in a fast-paced retail environment.",
          "responsibilities": [
            "Processed transactions accurately and courteously at the register.",
            "Restocked shelves to ensure consistent product availability.",
            "Assisted customers with product inquiries and directions.",
            "Maintained organized and safe checkout and aisle areas."
          ]
        },
        {
          "company": "Whole Foods Market",
          "role": "Store Scanning Specialist",
          "startDate": "2018-05-01",
          "endDate": "2021-01-01",
          "location": "Honolulu, HI",
          "summary": "Maintained pricing integrity and signage accuracy across departments while providing technical support for scanners, scales, and labeling systems. Collaborated with corporate and regional teams to troubleshoot issues and improve operational efficiency. Recognized for problem-solving, reliability, and process accuracy.",
          "responsibilities": [
            "Used ServiceNow for ticketing and issue tracking to troubleshoot scanners, printers, and system errors.",
            "Performed BIZERBA scale resets, managed PLU data, and verified price synchronization.",
            "Operated Zebra and Honeywell handheld scanners for audits and labeling accuracy.",
            "Helped reduce Frozen Department bread shrink from dozens of lost items to nearly zero through data analysis and order adjustments.",
            "Audited store tags, signs, and pricing for accuracy and compliance with Weights & Measures.",
            "Trained backup staff to maintain pricing operations continuity.",
            "Served as liaison between store operations and corporate support for pricing and labeling systems."
          ]
        },
        {
          "company": "Whole Foods Market",
          "role": "Grocery Team Member (Bulk, Dairy & Frozen)",
          "startDate": "2015-03-01",
          "endDate": "2018-05-01",
          "location": "Honolulu, HI",
          "summary": "Supported daily grocery operations with a focus on freshness, organization, and compliance. Maintained CCOF Organic Integrity and provided dependable service across multiple departments while helping customers find products and understand store offerings.",
          "responsibilities": [
            "Stocked and rotated Bulk, Dairy, and Frozen products to maintain freshness and prevent spoilage.",
            "Handled large-volume bulk items, cleaned bins, and refilled containers following organic integrity standards.",
            "Maintained CCOF Organic Integrity through proper cleaning and product handling.",
            "Received deliveries, verified quantities, and organized back stock for efficient access.",
            "Assisted customers with questions and guided them through the Bulk section.",
            "Maintained compliance with sanitation, safety, and labeling standards.",
            "Collaborated across departments to meet stocking and merchandising goals."
          ]
        },
        {
          "company": "Down to Earth All Vegetarian Organic & Natural",
          "role": "Grocery Clerk",
          "startDate": "2012-11-01",
          "endDate": "2013-07-01",
          "location": "Kapolei, HI",
          "summary": "Delivered dependable service across grocery, chill, frozen, and bulk departments. Maintained accuracy in receiving and stocking, solved customer needs with professionalism, and contributed to a positive, team-driven work environment.",
          "responsibilities": [
            "Received and verified deliveries with precision, checking invoices and product condition for accuracy.",
            "Stocked grocery, chill, frozen, and bulk sections efficiently and neatly.",
            "Demonstrated accuracy and thoroughness when handling natural and organic products.",
            "Solved daily challenges in a friendly and productive manner to support customers and coworkers.",
            "Used Microsoft programs for inventory and communication tasks.",
            "Achieved a 99% Secret Shopper satisfaction score for service quality and attention to detail."
          ]
        },
        {
          "company": "Tamura Super Market",
          "role": "Stock Clerk",
          "startDate": "2008-11-01",
          "endDate": "2012-09-01",
          "location": "Waianae, HI",
          "summary": "Managed daily restocking and rotation for dairy and frozen departments. Ensured freshness, correct pricing, and department readiness while leading small teams to maintain workflow and product organization.",
          "responsibilities": [
            "Maintained stock rotation and quality in dairy and frozen sections.",
            "Received and unloaded weekly dairy shipments exceeding 250 crates.",
            "Verified pricing and labeling accuracy for perishable goods.",
            "Led 2–3 associates in completing stocking and organization tasks efficiently."
          ]
        },
        {
          "company": "McDonald’s",
          "role": "Crew Member",
          "startDate": "2014-01-01",
          "endDate": "2015-01-01",
          "location": "Waianae, HI",
          "summary": "Supported fast-paced kitchen operations with consistency and teamwork. Maintained quality, speed, and food safety standards during peak hours.",
          "responsibilities": [
            "Prepared and served menu items following company standards.",
            "Operated grill, fryer, and line stations during high-demand hours.",
            "Maintained cleanliness and food safety standards throughout shifts."
          ]
        },
        {
          "company": "Walmart",
          "role": "Seasonal Cart Associate",
          "startDate": "2013-11-01",
          "endDate": "2013-12-01",
          "location": "Kapolei, HI",
          "summary": "Provided customer support through efficient cart retrieval and store accessibility. Ensured a safe, organized parking area while assisting customers with heavy purchases.",
          "responsibilities": [
            "Collected and organized carts using powered equipment.",
            "Assisted customers loading heavy or bulky purchases.",
            "Maintained a clear and safe parking area for customer access."
          ]
        },
        {
          "company": "Costco Wholesale",
          "role": "Seasonal Maintenance Worker",
          "startDate": "2005-11-01",
          "endDate": "2005-12-01",
          "location": "Honolulu, HI",
          "summary": "Maintained a clean, safe store environment through regular sanitation, waste removal, and customer area upkeep during peak retail hours.",
          "responsibilities": [
            "Cleaned and restocked restrooms throughout shifts.",
            "Swept, mopped, and removed debris from high-traffic areas.",
            "Disposed of waste safely and maintained overall cleanliness."
          ]
        }
      ]
    }
  },
  "skills": [
    { "name": "Customer Service & Experience Management", "level": "Expert", "value": 5 },
    { "name": "Team Leadership & Collaboration", "level": "Expert", "value": 5 },
    { "name": "Dependability & Accountability", "level": "Expert", "value": 5 },
    { "name": "Verbal & Written Communication", "level": "Expert", "value": 5 },
    { "name": "Workplace Safety & Compliance", "level": "Advanced", "value": 4 },
    { "name": "Process Accuracy & Quality Control", "level": "Advanced", "value": 4 },
    { "name": "Inventory & Stock Management", "level": "Advanced", "value": 4 },
    { "name": "Pricing Accuracy & Visual Merchandising", "level": "Advanced", "value": 4 },
    { "name": "Training & Staff Support", "level": "Advanced", "value": 4 },
    { "name": "Process Improvement & Workflow Coordination", "level": "Advanced", "value": 4 },
    { "name": "Time & Task Management", "level": "Advanced", "value": 4 },
    { "name": "Adaptability in Fast-Paced Environments", "level": "Advanced", "value": 4 },
    { "name": "Problem Solving & Decision-Making", "level": "Advanced", "value": 4 },
    { "name": "Safety Auditing & Risk Identification", "level": "Advanced", "value": 4 },
    { "name": "Organizational Efficiency", "level": "Advanced", "value": 4 },
    { "name": "Employee Engagement & Motivation", "level": "Intermediate", "value": 3 },
    { "name": "Data Entry & Reporting Accuracy", "level": "Intermediate", "value": 3 },
    { "name": "Conflict Resolution", "level": "Intermediate", "value": 3 }
  ],
  "projects": [
    {
      "title": "Shopify Desktop Admin",
      "description": "Developed a cross-platform desktop application using Electron and Vue.js to manage Shopify product data. Improved workflow by automating bulk uploads and variant updates, reducing manual entry time and errors."
    }
  ],
  "education": [
    {
      "school": "Azalea Garden Christian School / State of Virginia",
      "location": "Norfolk, VA",
      "program": "High School Coursework and GED",
      "startDate": "1995-01-01",
      "endDate": "1998-01-01",
      "notes": "Completed coursework at Azalea Garden Christian School and earned GED certification through the State of Virginia in 1998."
    },
    {
      "school": "Tidewater Community College",
      "location": "Norfolk, VA",
      "program": "A+ Certification Coursework",
      "startDate": "2001-01-01",
      "endDate": "2001-01-01",
      "notes": "Completed A+ certification coursework focused on computer systems, troubleshooting, and data management."
    }
  ]
}
