{
  "base": {
    "name": "Neill Holloman",
    "title": "Coder & Entrepreneur at Amazon",
    "summary": "Disciplined and analytical professional with experience in customer service, safety, and technology."
  },
  "resumes": {
    "customerService": {
      "experience": [
        {
          "company": "Amazon Delivery Station (DHI2)",
          "role": "Delivery Station Associate",
          "dates": "August 2024 – Present",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Induct and process packages on ADTA conveyor systems according to established procedures.",
            "Handle hazardous and non-hazardous packages in compliance with EPA and company safety standards.",
            "Identify and report damaged or problem packages to maintain accuracy and workflow.",
            "Conduct safety walks using WHS checklists to identify potential hazards.",
            "Submit feedback through Voice of Associate (VOA) to improve safety and process efficiency."
          ]
        },
        {
          "company": "TJ Maxx & HomeGoods",
          "role": "Backroom Associate",
          "dates": "2024",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Unloaded freight and sorted merchandise for tagging and stocking.",
            "Organized stockroom inventory and supported sales floor replenishment.",
            "Followed store loss prevention procedures during inventory handling."
          ]
        },
        {
          "company": "Advantage Solutions (Costco Demo)",
          "role": "Sales Advisor",
          "dates": "April 2024 – August 2024",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Conducted product demonstrations and engaged with customers to promote sales.",
            "Maintained sampling area cleanliness and complied with health regulations.",
            "Tracked product performance and reported feedback to supervisors."
          ]
        },
        {
          "company": "Y. Hata & Co., Ltd. / ChefZone",
          "role": "Night Stock Clerk",
          "dates": "2021 – 2022",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Received and restocked inventory following rotation and safety standards.",
            "Operated pallet jacks safely to move freight and organize warehouse areas.",
            "Prepared aisles and shelves for morning operations and customer readiness.",
            "Followed store procedures for labeling, storage, and organization."
          ]
        },
        {
          "company": "Longs Drugs",
          "role": "Customer Service Associate",
          "dates": "2021",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Processed transactions and assisted customers at checkout.",
            "Restocked front-end merchandise and kept displays organized.",
            "Directed customers to product locations and answered basic questions."
          ]
        },
        {
          "company": "Starbucks",
          "role": "Customer Service Associate",
          "dates": "2021",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Handled cashier duties and prepared food orders in the oven station.",
            "Maintained cleanliness and restocked supplies throughout shifts.",
            "Provided fast, friendly customer service during peak hours."
          ]
        },
        {
          "company": "Whole Foods Market",
          "role": "Store Scanning Specialist",
          "dates": "2018 – 2021",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Checked and updated storewide pricing for accuracy and compliance.",
            "Worked with corporate and regional pricing teams to correct errors.",
            "Performed required scale inspections and maintained compliance records.",
            "Reported maintenance issues using ServiceNow ticketing system.",
            "Assisted departments in maintaining accurate price tags and signage."
          ]
        },
        {
          "company": "Lowe’s Home Improvement",
          "role": "Customer Service Associate",
          "dates": "2017 – 2018",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Assisted customers in locating products, handling returns, and completing purchases.",
            "Processed transactions accurately using POS systems.",
            "Supported restocking and maintained department displays.",
            "Provided coverage during peak hours to keep service areas running smoothly."
          ]
        },
        {
          "company": "Whole Foods Market",
          "role": "Grocery Clerk",
          "dates": "2015 – 2018",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Stocked shelves, rotated products, and ensured displays met company standards.",
            "Provided customer assistance in locating products and answering questions.",
            "Checked product dates and maintained food safety compliance.",
            "Worked efficiently with team members to complete daily restocking tasks."
          ]
        },
        {
          "company": "McDonald’s",
          "role": "Crew Member",
          "dates": "2014 – 2015",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Prepared food items according to safety and sanitation standards.",
            "Maintained cleanliness in kitchen and service areas.",
            "Worked with team members to meet service time goals during busy hours."
          ]
        },
        {
          "company": "Walmart",
          "role": "Seasonal Cart Associate",
          "dates": "2013",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Collected and organized shopping carts for customer use.",
            "Assisted with lot organization and maintained store entry safety.",
            "Provided assistance to customers as needed in parking and entry areas."
          ]
        },
        {
          "company": "Costco Wholesale",
          "role": "Seasonal Maintenance Worker",
          "dates": "2005",
          "location": "Honolulu, HI",
          "responsibilities": [
            "Cleaned restrooms, swept floors, and maintained store cleanliness standards.",
            "Assisted with basic maintenance and janitorial tasks.",
            "Worked independently to ensure assigned zones were completed daily."
          ]
        }
      ]
    }
  },
  "skills": [
    "Customer Service",
    "Teamwork",
    "Safety Awareness",
    "Time Management",
    "Organization",
    "Dependability",
    "Attention to Detail",
    "Process Accuracy"
  ],
  "projects": [
    {
      "title": "Shopify Desktop Admin", 
      "description": "Created a desktop application for managing Shopify product data efficiently."
    }
  ],
  "education": [
    {
      "school": "Community College of Hawaii",
      "program": "Information Technology Coursework",
      "notes": "Completed coursework in computer systems, troubleshooting, and data organization."
    }
  ]
}
