{
  "base": {
    "name": "Neill Holloman",
    "title": "Coder & Entrepreneur at Amazon",
    "summary": "Disciplined and analytical professional with experience in customer service, safety, and technology. Dedicated to delivering efficient, high-quality results while ensuring customer satisfaction and workplace excellence."
  },
  "resumes": {
    "customerService": {
      "experience": [
        {
          "company": "Amazon Delivery Station (DHI2)",
          "role": "Delivery Station Associate",
          "dates": "August 2024 – Present",
          "location": "Honolulu, HI",
          "summary": "Provide dependable and accurate customer-focused support by ensuring safe, efficient package handling and clear workflow communication.",
          "responsibilities": [
            "Process and induct packages on ADTA conveyor systems, maintaining speed and accuracy for on-time customer deliveries.",
            "Handle hazardous and non-hazardous packages in compliance with EPA and safety standards.",
            "Identify, report, and resolve damaged or problem packages to prevent delivery delays.",
            "Conduct safety walks using WHS checklists and report hazards to leadership for resolution.",
            "Submit feedback through Voice of Associate (VOA) to improve safety procedures and station productivity.",
            "Serve as Safety Committee member to promote best practices and ensure compliance with Amazon policy."
          ]
        },
        {
          "company": "TJ Maxx & HomeGoods",
          "role": "Backroom Associate",
          "dates": "2024",
          "location": "Honolulu, HI",
          "summary": "Supported merchandise flow and customer readiness through efficient organization, tagging, and replenishment of stockroom inventory.",
          "responsibilities": [
            "Unloaded freight and sorted merchandise for processing and floor display preparation.",
            "Applied security tags to high-value merchandise to minimize shrinkage.",
            "Organized stockroom areas for safety and accessibility to support store efficiency.",
            "Assisted floor teams by replenishing inventory and ensuring proper presentation of products."
          ]
        },
        {
          "company": "Advantage Solutions (Costco Demo)",
          "role": "Sales Advisor",
          "dates": "April 2024 – August 2024",
          "location": "Honolulu, HI",
          "summary": "Delivered engaging product demonstrations and customer experiences that strengthened brand awareness and boosted sales.",
          "responsibilities": [
            "Conducted live demonstrations for Costco shoppers, engaging customers and promoting featured products.",
            "Provided accurate and persuasive product information to support purchasing decisions.",
            "Maintained compliance with sanitation and health regulations at all times.",
            "Tracked daily sales performance and customer engagement for reporting to supervisors."
          ]
        },
        {
          "company": "Y. Hata & Co., Ltd. / ChefZone",
          "role": "Night Stock Clerk",
          "dates": "2021 – 2022",
          "location": "Honolulu, HI",
          "summary": "Maintained organized and fully stocked aisles to ensure smooth warehouse operations and next-day customer readiness.",
          "responsibilities": [
            "Received and restocked inventory using safe material handling practices.",
            "Operated pallet jacks to transport freight safely and efficiently.",
            "Labeled and rotated stock according to company policy and safety standards.",
            "Prepared aisles and storage areas for seamless morning operations."
          ]
        },
        {
          "company": "Longs Drugs",
          "role": "Customer Service Associate",
          "dates": "2021",
          "location": "Honolulu, HI",
          "summary": "Delivered fast, friendly, and accurate customer service while maintaining checkout and store organization standards.",
          "responsibilities": [
            "Processed customer transactions quickly and accurately at checkout.",
            "Assisted customers with product locations and general inquiries.",
            "Restocked shelves and maintained neat, accessible product displays.",
            "Handled exchanges and returns in a professional and courteous manner."
          ]
        },
        {
          "company": "Starbucks",
          "role": "Customer Service Associate",
          "dates": "2021",
          "location": "Honolulu, HI",
          "summary": "Provided exceptional service and product quality to every guest, ensuring a welcoming and efficient environment.",
          "responsibilities": [
            "Handled cashier duties and prepared food orders for customers during high-volume hours.",
            "Maintained a clean, organized workspace to ensure smooth operations.",
            "Restocked supplies and coordinated with team members to meet customer demand."
          ]
        },
        {
          "company": "Whole Foods Market",
          "role": "Store Scanning Specialist",
          "dates": "2018 – 2021",
          "location": "Honolulu, HI",
          "summary": "Supported store operations by ensuring accurate pricing, compliance, and reliable communication across departments.",
          "responsibilities": [
            "Updated and verified pricing accuracy for thousands of products storewide.",
            "Coordinated with corporate and regional pricing teams to resolve discrepancies.",
            "Performed scale inspections and ensured compliance documentation met regulatory standards.",
            "Reported maintenance and system issues using ServiceNow for timely resolution.",
            "Assisted team members with audits and trained new employees on labeling systems."
          ]
        },
        {
          "company": "Lowe’s Home Improvement",
          "role": "Customer Service Associate",
          "dates": "2017 – 2018",
          "location": "Honolulu, HI",
          "summary": "Built trust with customers by providing product assistance, accurate transactions, and dependable front-end support.",
          "responsibilities": [
            "Assisted customers in locating products, handling returns, and completing purchases.",
            "Ranked #2 regionally for customer satisfaction through consistent survey performance.",
            "Processed sales transactions accurately through POS systems during busy hours.",
            "Provided department coverage and assisted with merchandise restocking."
          ]
        },
        {
          "company": "Whole Foods Market",
          "role": "Grocery Clerk",
          "dates": "2015 – 2018",
          "location": "Honolulu, HI",
          "summary": "Maintained product quality, display standards, and responsive customer service in a high-traffic grocery environment.",
          "responsibilities": [
            "Stocked and rotated products to maintain freshness and visibility.",
            "Assisted customers with product questions and recommendations.",
            "Maintained compliance with food safety and sanitation procedures.",
            "Collaborated across departments to meet daily stocking goals."
          ]
        },
        {
          "company": "McDonald’s",
          "role": "Crew Member",
          "dates": "2014 – 2015",
          "location": "Honolulu, HI",
          "summary": "Worked in a fast-paced environment to prepare quality food, maintain cleanliness, and ensure customer satisfaction.",
          "responsibilities": [
            "Prepared menu items following company quality and safety standards.",
            "Maintained a clean kitchen and dining area to uphold brand standards.",
            "Supported team members during peak service periods for on-time fulfillment."
          ]
        },
        {
          "company": "Walmart",
          "role": "Seasonal Cart Associate",
          "dates": "2013",
          "location": "Honolulu, HI",
          "summary": "Ensured a safe and welcoming customer environment through organized cart retrieval and entryway maintenance.",
          "responsibilities": [
            "Collected and organized shopping carts to maintain store accessibility.",
            "Assisted customers with loading purchases when needed.",
            "Kept entry and parking areas clean and free from obstruction."
          ]
        },
        {
          "company": "Costco Wholesale",
          "role": "Seasonal Maintenance Worker",
          "dates": "2005",
          "location": "Honolulu, HI",
          "summary": "Maintained store cleanliness and supported daily operations to enhance the customer shopping experience.",
          "responsibilities": [
            "Cleaned restrooms, floors, and public areas to ensure sanitary conditions.",
            "Disposed of trash and maintained a safe, orderly environment.",
            "Worked independently and efficiently to complete assigned tasks daily."
          ]
        }
      ]
    }
  },
  "skills": [
    { "name": "Customer Service", "level": "Expert", "value": 5 },
    { "name": "Teamwork", "level": "Expert", "value": 5 },
    { "name": "Safety Awareness", "level": "Advanced", "value": 4 },
    { "name": "Time Management", "level": "Advanced", "value": 4 },
    { "name": "Organization", "level": "Advanced", "value": 4 },
    { "name": "Dependability", "level": "Expert", "value": 5 },
    { "name": "Attention to Detail", "level": "Advanced", "value": 4 },
    { "name": "Process Accuracy", "level": "Advanced", "value": 4 },
    { "name": "Communication", "level": "Expert", "value": 5 },
    { "name": "Conflict Resolution", "level": "Advanced", "value": 4 },
    { "name": "Adaptability", "level": "Advanced", "value": 4 },
    { "name": "Problem Solving", "level": "Advanced", "value": 4 },
    { "name": "Training Support", "level": "Intermediate", "value": 3 }
  ],
  "projects": [
    {
      "title": "Shopify Desktop Admin",
      "description": "Created a cross-platform desktop application using Electron and Vue.js to manage Shopify product data. Automated bulk uploads and streamlined variant updates, improving efficiency for e-commerce workflows."
    },
    {
      "title": "UPT Calculator App",
      "description": "Developed a responsive progressive web app using React and Tailwind CSS to help Amazon associates track UPT accrual, usage, and scheduling. Implemented IndexedDB for offline use and data persistence."
    }
  ],
  "education": [
    {
      "school": "Community College of Hawaii",
      "program": "Information Technology Coursework",
      "notes": "Completed coursework in computer systems, troubleshooting, and data organization with a focus on applying technology to real-world workplace processes."
    }
  ]
}
