{
  "base": {
    "name": "Neill Holloman",
    "title": "Customer Service Professional",
    "address": "Honolulu, HI 96817",
    "email": "neill@holloman.life",
    "photo": "profileImage.jpg",
    "summary": "Dedicated and reliable customer service professional with more than 15 years of experience across retail, grocery, and logistics. Recognized for maintaining precision and calm under pressure while supporting team efficiency and customer satisfaction. Skilled in sales support, product knowledge, and process accuracy with a strong focus on safety, organization, and clear communication. Known for taking initiative, improving workflows, and fostering a cooperative environment where both customers and coworkers succeed.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/neill-holloman-70a5b030/",
      "github": "https://github.com/AhonuiHawaii",
      "portfolio": "https://github.com/AhonuiHawaii"
    }
  },
  "resumes": {
    "customerService": {
      "experience": [
        {
          "company": "Amazon",
          "role": "Delivery Station Associate",
          "startDate": "2024-08-01",
          "endDate": null,
          "location": "Honolulu, HI",
          "summary": "Contribute to a high-volume logistics environment with focus on accuracy, safety, and workflow efficiency. Actively promote safety culture as part of the Associate Safety Committee, leading process improvements and ensuring compliance with environmental standards.",
          "responsibilities": [
            "Operate ADTA Conveyor systems including Induct, Unload, Pusher, Diverter, Straightener, and Stow stations to sustain smooth package flow.",
            "Restructured the Hazmat cage by grouping materials such as Corrosive, Flammable, Environmental Hazard, Food-Grade Waste, and E-Waste for safer handling and quicker access.",
            "Researched EPA classifications to support accurate identification and disposal of hazardous materials.",
            "Trained an associate in Hazmat handling and documentation procedures to maintain compliance and consistency.",
            "Served on the Associate Safety Committee from August 2024 to February 2025, assisting with safety walks and hazard reduction initiatives.",
            "Performed detailed reviews of problem packages, ensuring they were processed correctly and in line with delivery timelines.",
            "Submitted safety and process improvement observations through Dragonfly and VOA systems."
          ]
        },
        {
          "company": "Advantage Solutions",
          "role": "Sales Advisor",
          "startDate": "2024-04-01",
          "endDate": "2024-08-01",
          "location": "Honolulu, HI",
          "summary": "Engaged customers through live product demonstrations at Costco, combining product knowledge with clear communication to drive sales and positive customer interactions.",
          "responsibilities": [
            "Delivered product demonstrations that regularly achieved daily and weekly sales goals.",
            "Built strong rapport with customers by clearly explaining product features and benefits.",
            "Adapted to a variety of product categories, maintaining a consistent presentation quality.",
            "Ensured compliance with health and safety guidelines for sampling and setup.",
            "Kept demonstration areas clean, organized, and well-stocked throughout each shift."
          ]
        },
        {
          "company": "TJ Maxx & HomeGoods",
          "role": "Backroom Associate",
          "startDate": "2024-04-01",
          "endDate": "2024-08-01",
          "location": "Honolulu, HI",
          "summary": "Supported retail operations by organizing freight, maintaining safety in the stockroom, and preparing merchandise for floor display in a fast-paced team environment.",
          "responsibilities": [
            "Unloaded incoming shipments and sorted items for efficient processing.",
            "Applied security tags to high-theft merchandise to reduce shrink.",
            "Kept the backroom organized and compliant with safety and accessibility standards.",
            "Assisted with merchandise flow to ensure timely replenishment and presentation quality.",
            "Prepared carts and racks to support sales floor transitions during peak hours."
          ]
        },
        {
          "company": "Food Pantry, Ltd.",
          "role": "Scan Coordinator",
          "startDate": "2022-10-01",
          "endDate": "2023-09-01",
          "location": "Honolulu, HI",
          "summary": "Maintained pricing accuracy and coordinated with corporate IT and management teams to resolve scanning issues and ensure smooth store operations.",
          "responsibilities": [
            "Audited between 1,000 and 2,000 pricing scans each month to verify accuracy and compliance.",
            "Worked with corporate technical teams to troubleshoot ESL (Electronic Shelf Label) malfunctions.",
            "Managed grocery ordering during leadership absences to sustain proper inventory levels.",
            "Implemented markdowns and promotional adjustments to improve stock turnover and reduce waste.",
            "Corrected scan errors and price discrepancies to maintain customer trust and operational consistency."
          ]
        },
        {
          "company": "Lowe’s Home Improvement",
          "role": "Cashier",
          "startDate": "2022-01-01",
          "endDate": "2022-09-01",
          "location": "Honolulu, HI",
          "summary": "Provided high-quality checkout experiences in a busy retail environment. Recognized for customer satisfaction and sales performance through consistent professionalism and accuracy.",
          "responsibilities": [
            "Ranked #2 in the Pacific Region for customer satisfaction scores.",
            "Promoted store credit programs, successfully enrolling 3–4 customers per month.",
            "Processed returns, exchanges, and payments with accuracy and courtesy.",
            "Operated self-checkout systems and assisted customers with technical issues.",
            "Maintained an organized and efficient checkout area during high-traffic hours."
          ]
        },
        {
          "company": "Starbucks",
          "role": "Barista",
          "startDate": "2021-12-01",
          "endDate": "2022-07-01",
          "location": "Honolulu, HI",
          "summary": "Delivered friendly and accurate service while maintaining consistency in drink preparation, teamwork, and store cleanliness.",
          "responsibilities": [
            "Prepared espresso and blended beverages to company specifications.",
            "Handled point-of-sale operations with attention to order accuracy and speed.",
            "Supported coworkers during peak hours to maintain smooth customer flow.",
            "Monitored and restocked inventory throughout shifts.",
            "Followed all food safety and sanitation standards diligently."
          ]
        },
        {
          "company": "Y. Hata & Co., Ltd. (ChefZone)",
          "role": "Night Stock Clerk",
          "startDate": "2021-05-01",
          "endDate": "2021-08-01",
          "location": "Honolulu, HI",
          "summary": "Worked overnight shifts handling incoming freight, stocking shelves, and keeping ChefZone clean, organized, and ready for business. Known for steady pace, accuracy, and strong attention to safety while operating warehouse equipment and supporting teammates.",
          "responsibilities": [
            "Received and organized shipments with accuracy, checking quantities and product condition before stocking.",
            "Used electric pallet jacks and reach forklifts to move pallets safely through tight warehouse spaces.",
            "Rotated inventory and maintained clean shelves and aisles to prevent clutter and product loss.",
            "Priced and labeled items quickly so merchandise was floor-ready for customers the next day.",
            "Answered questions from ChefZone members and directed them to the products they needed.",
            "Followed HAACP and GMP guidelines for handling and storing food items properly.",
            "Stayed alert to hazards and followed safe lifting and equipment procedures.",
            "Kept a steady work rhythm through the night to make sure the store was stocked and ready for opening."
          ]
        },
        {
          "company": "Longs Drugs",
          "role": "Customer Service Associate",
          "startDate": "2021-03-01",
          "endDate": "2021-05-01",
          "location": "Honolulu, HI",
          "summary": "Assisted customers with purchases and inquiries while maintaining accuracy and efficiency in store operations.",
          "responsibilities": [
            "Processed transactions quickly and correctly at the register.",
            "Restocked shelves to maintain product availability.",
            "Helped customers locate items and answered general questions.",
            "Maintained a clean and organized work area."
          ]
        },
        {
            "company": "Whole Foods Market",
            "role": "Store Scanning Specialist",
            "startDate": "2018-05-01",
            "endDate": "2021-01-01",
            "location": "Honolulu, HI",
            "summary": "Maintained pricing integrity, signage accuracy, and scale compliance across departments while serving as a point of contact between store operations and corporate support teams. Provided technical troubleshooting, audit accuracy, and data integrity that improved store efficiency and compliance. Promoted into this position after demonstrating reliability and detail focus as a Grocery Team Member.",
            "responsibilities": [
              "Used ServiceNow for ticketing and issue tracking to troubleshoot scanning systems, printers, and store hardware.",
              "Performed BIZERBA scale resets, managed PLU data, and ensured accurate price synchronization across systems.",
              "Operated Zebra and Honeywell handheld scanners for inventory and pricing audits.",
              "Audited tags, signage, and shelf pricing to ensure compliance with company and Weights & Measures standards.",
              "Printed and distributed shelf tags and maintained tag strips for upcoming price changes.",
              "Worked with regional and corporate IT teams to identify and resolve label and system errors.",
              "Helped the Frozen Department’s bread buyer reduce product shrink from dozens of lost items to nearly zero by analyzing sales data and correcting order patterns.",
              "Completed audit reports, tracked discrepancies, and followed up with leadership for correction.",
              "Supported Weights & Measures inspections, collected feedback, and implemented corrective actions.",
              "Trained replacement staff before transitioning roles to ensure continuity of operations.",
              "Provided technical assistance to team members for scanners, label printers, and office systems.",
              "Maintained professional communication and upheld Whole Foods Market’s core standards for accuracy, service, and food safety."
            ]
          },
        {
          "company": "Whole Foods Market",
          "role": "Grocery Team Member (Bulk, Dairy & Frozen)",
          "startDate": "2015-03-01",
          "endDate": "2018-05-01",
          "location": "Honolulu, HI",
          "summary": "Supported daily grocery operations with a focus on Bulk, Dairy, and Frozen departments. Maintained product freshness, accurate rotation, and store presentation while keeping shelves clean, organized, and compliant with Whole Foods standards.",
          "responsibilities": [
            "Stocked and rotated Bulk, Dairy, and Frozen products to maintain freshness and prevent spoilage.",
            "Handled large-volume bulk items, cleaned bins, and refilled containers following organic integrity guidelines.",
            "Maintained CCOF Organic Integrity through proper cleaning and product handling.",
            "Checked product dates and maintained consistent shelf organization for a clean and appealing display.",
            "Received deliveries, verified quantities, and organized back stock to ensure efficient access for restocking.",
            "Assisted customers with product questions and guided them through the Bulk section for refills and ingredients.",
            "Maintained compliance with sanitation, safety, and labeling standards for all perishable items.",
            "Collaborated with team members across departments to meet stocking goals and maintain workflow during peak hours.",
            "Worked efficiently in cold and fast-paced conditions, supporting multiple sections during shifts."
          ]
        },
        {
          "company": "McDonald’s",
          "role": "Crew Member",
          "startDate": "2014-01-01",
          "endDate": "2015-01-01",
          "location": "Waianae, HI",
          "summary": "Worked efficiently in a fast-paced kitchen environment to deliver consistent food quality and service.",
          "responsibilities": [
            "Prepared and served menu items following company standards.",
            "Operated grill, fryer, and line stations during high-demand hours.",
            "Maintained cleanliness and food safety standards throughout shifts."
          ]
        },
        {
          "company": "Walmart",
          "role": "Seasonal Cart Associate",
          "startDate": "2013-11-01",
          "endDate": "2013-12-01",
          "location": "Kapolei, HI",
          "summary": "Supported store accessibility by managing cart retrieval and assisting customers as needed.",
          "responsibilities": [
            "Collected and organized carts using powered equipment.",
            "Assisted customers loading heavy or bulky purchases.",
            "Maintained a clear and safe parking area for customer access."
          ]
        },
{
  "company": "Down to Earth All Vegetarian Organic & Natural",
  "role": "Grocery Clerk",
  "startDate": "2012-11-01",
  "endDate": "2013-07-01",
  "location": "Kapolei, HI",
  "summary": "Supported daily grocery operations across chill, frozen, and bulk departments while maintaining accuracy, freshness, and customer satisfaction. Known for dependability, positive communication, and attention to detail in a team-oriented natural foods environment.",
  "responsibilities": [
    "Received and verified deliveries with precision, checking invoices and product condition for accuracy.",
    "Stocked grocery, chill, frozen, and bulk sections efficiently while maintaining a clean, organized workspace.",
    "Demonstrated accuracy and thoroughness when handling natural and organic products.",
    "Solved day-to-day challenges in a professional, friendly, and helpful manner to support customers and coworkers.",
    "Assisted customers with product recommendations, dietary inquiries, and store navigation.",
    "Communicated clearly with team members to coordinate restocking and maintain department readiness.",
    "Used basic computer applications, including Microsoft programs, for inventory and store communication tasks.",
    "Achieved a 99% Secret Shopper satisfaction score for service quality and accuracy."
  ]
},
        {
          "company": "Tamura Super Market",
          "role": "Stock Clerk",
          "startDate": "2008-11-01",
          "endDate": "2012-09-01",
          "location": "Waianae, HI",
          "summary": "Oversaw inventory and quality in dairy and frozen departments, ensuring freshness, correct pricing, and efficient stocking procedures.",
          "responsibilities": [
            "Managed milk and frozen sections with over 20 refrigerated doors of product.",
            "Received weekly dairy shipments exceeding 250 crates and verified accuracy.",
            "Maintained proper rotation and labeling for perishable goods.",
            "Led small teams of 2–3 associates during restocking operations."
          ]
        },
        {
          "company": "Costco Wholesale",
          "role": "Seasonal Maintenance Worker",
          "startDate": "2005-11-01",
          "endDate": "2005-12-01",
          "location": "Honolulu, HI",
          "summary": "Maintained store cleanliness and customer safety through consistent upkeep of restrooms and public areas.",
          "responsibilities": [
            "Cleaned and restocked restrooms throughout shifts.",
            "Swept, mopped, and removed debris from high-traffic areas.",
            "Disposed of waste safely and maintained overall cleanliness."
          ]
        }
      ]
    }
  },
"skills": [
  { "name": "Customer Service Excellence", "level": "Expert", "value": 5 },
  { "name": "Team Collaboration & Support", "level": "Expert", "value": 5 },
  { "name": "Dependability & Accountability", "level": "Expert", "value": 5 },
  { "name": "Verbal & Written Communication", "level": "Expert", "value": 5 },
  { "name": "Workplace Safety Leadership", "level": "Advanced", "value": 4 },
  { "name": "Process Accuracy & Compliance", "level": "Advanced", "value": 4 },
  { "name": "Quality & Detail Control", "level": "Advanced", "value": 4 },
  { "name": "Time & Task Management", "level": "Advanced", "value": 4 },
  { "name": "Organizational Efficiency", "level": "Advanced", "value": 4 },
  { "name": "Adaptability in Fast-Paced Environments", "level": "Advanced", "value": 4 },
  { "name": "Inventory & Stock Management", "level": "Advanced", "value": 4 },
  { "name": "Pricing Accuracy & Label Integrity", "level": "Advanced", "value": 4 },
  { "name": "POS & Scanning Systems Operation", "level": "Advanced", "value": 4 },
  { "name": "Process Improvement & Workflow Optimization", "level": "Advanced", "value": 4 },
  { "name": "Problem Solving & Root-Cause Analysis", "level": "Intermediate", "value": 3 },
  { "name": "Training & Peer Support", "level": "Intermediate", "value": 3 },
  { "name": "Data Entry & Reporting Accuracy", "level": "Intermediate", "value": 3 },
  { "name": "Safety Auditing & Risk Identification", "level": "Advanced", "value": 4 }
],
  "projects": [
    {
      "title": "Shopify Desktop Admin",
      "description": "Developed a desktop application using Electron and Vue.js to organize and update Shopify product data. Improved workflow by automating bulk uploads and variant management, reducing manual entry time and errors."
    }
  ],
  "education": [
    {
      "school": "Azalea Garden Christian School / State of Virginia",
      "location": "Norfolk, VA",
      "program": "High School Coursework and GED",
      "startDate": "1995-01-01",
      "endDate": "1998-01-01",
      "notes": "Completed coursework at Azalea Garden Christian School and earned GED certification through the State of Virginia in 1998."
    },
    {
      "school": "Tidewater Community College",
      "location": "Norfolk, VA",
      "program": "A+ Certification Coursework",
      "startDate": "2001-01-01",
      "endDate": "2001-01-01",
      "notes": "Completed A+ certification coursework focused on computer systems, troubleshooting, and data management."
    }
  ]
}
